ЕСКД/src/Catalogs/mega_ЕдиницыИзмерения/mega_ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_ЕдиницыИзмерения</name>
  <owners>Catalog.mega_Номенклатура</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <type>
      <types>CatalogRef.mega_КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЦелаяНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЦелаяНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЕСКД/src/Catalogs/mega_ЕдиницыИзмерения/ManagerModule.bsl
Функция НайтиСоздатьЕдиницуПоКлассификатору(Владелец, ЕдиницаПоКлассификатору)Экспорт 
	
	ЕдиницаИзмерения = НайтиПоРеквизиту("ЕдиницаПоКлассификатору", ЕдиницаПоКлассификатору, , Владелец);
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда 
		
		Возврат ЕдиницаИзмерения;
	КонецЕсли;                   
	
	ЕдиницаИзмерения = СоздатьЭлемент();
	ЕдиницаИзмерения.Наименование = Строка(ЕдиницаПоКлассификатору);
	ЕдиницаИзмерения.ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору;
	ЕдиницаИзмерения.Числитель = 1;ЕдиницаИзмерения.Знаменатель = 1;
	ЕдиницаИзмерения.Длина = 1;ЕдиницаИзмерения.Ширина = 1;
	ЕдиницаИзмерения.Высота = 1;ЕдиницаИзмерения.Вес = 1;
	ЕдиницаИзмерения.Объем = 1;
	ЕдиницаИзмерения.Владелец = Владелец;                              
	
	ЕдиницаИзмерения.Записать();
	Возврат ЕдиницаИзмерения.Ссылка;
КонецФункции

Функция ПеревестиИзЕдиницыВЕдиницу(Количество, ЕдиницаКоличества, ЕдиницаДляРасчета)Экспорт 
	
	Возврат (ЕдиницаКоличества.Числитель / ЕдиницаКоличества.Знаменатель * Количество) * (ЕдиницаДляРасчета.Числитель / ЕдиницаДляРасчета.Знаменатель);
КонецФункции
